# VPC - Subnet 문제

## The DB instance and EC2 security group are in different VPCs

```tf
rds {
  subnet_ids = module.vpc.private_subnets

  vpc_security_group_ids = [module.db_security_group.security_group_id]
}
```
```shell
module.db.module.db_instance.aws_db_instance.this[0]: Creating...
╷
│ Error: creating RDS DB Instance (ticketingdb): InvalidParameterCombination: The DB instance and EC2 security group are in different VPCs. The DB instance is in vpc-0c64ddf0537566c43 and the EC2 security group is in vpc-030e8256d4a939e6b
│       status code: 400, request id: 2eb29030-23d2-4f9a-b4fd-7b4a2e94b000
│ 
│   with module.db.module.db_instance.aws_db_instance.this[0],
│   on .terraform/modules/db/modules/db_instance/main.tf line 29, in resource "aws_db_instance" "this":
│   29: resource "aws_db_instance" "this" {
│ 
╵
```

## DBSubnetGroup 'main-private-ap-northeast-2a' not found.

```tf

public_subnet_names = ["main-public-ap-northeast-2a", "main-public-ap-northeast-2b"]
private_subnet_names = ["main-private-ap-northeast-2a", "main-private-ap-northeast-2b"]

rds {
  # If unspecified, will be created in the default VPC
  db_subnet_group_name = local.private_subnet_names[1] 
  create_db_subnet_group = false
  subnet_ids = module.vpc.private_subnets

  vpc_security_group_ids = [module.db_security_group.security_group_id]
}
```

```shell
│ Error: creating RDS DB Instance (ticketingdb): DBSubnetGroupNotFoundFault: DBSubnetGroup 'main-private-ap-northeast-2a' not found.
│       status code: 404, request id: 59f53bd2-d00d-4519-844e-7be1d384b33d
│ 
│   with module.db.module.db_instance.aws_db_instance.this[0],
│   on .terraform/modules/db/modules/db_instance/main.tf line 29, in resource "aws_db_instance" "this":
│   29: resource "aws_db_instance" "this" {
│ 
╵
```

## 해결방법

### 추측
- Terraform은 DB subnet을 별도로 생성할 것을 기본으로 사용
- 따라서 VPC에서 db_subnet을 만들어야 한다 (왜?....)
- rds 모듈에서 최종적으로 subnet_ids 등은 해당 "aws_db_subnet_group" resource로 전달


## 참조
- [Terraform AWS Provider DB Sunbet Group](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/db_subnet_group )
    - 특이하게 Input으로 다시 Subnet Id를 받는다. (Required)

<br/>

```tf
module "db_subnet_group" {
  source = "./modules/db_subnet_group"

  create = local.create_db_subnet_group

  subnet_ids      = var.subnet_ids
}


# ./modules/db_subnet_group
resource "aws_db_subnet_group" "this" {
  count = var.create ? 1 : 0

  subnet_ids  = var.subnet_ids
}

```
> https://github.com/terraform-aws-modules/terraform-aws-rds/blob/master/modules/db_subnet_group/main.tf
> https://github.com/terraform-aws-modules/terraform-aws-rds/blob/master/main.tf#L21C25-L21C35

<br/>

```tf
Subnet group
The next resource is an aws_db_subnet_group, which designates a collection of subnets that your RDS instance can be provisioned in. This subnet group uses the subnets created by the VPC module.

resource "aws_db_subnet_group" "education" {
  name       = "education"
  subnet_ids = module.vpc.public_subnets

  tags = {
    Name = "Education"
  }
}
This subnet group resource is an optional parameter in your aws_db_instance block below. Without it, Terraform creates your RDS instances in the default VPC.
````
> https://developer.hashicorp.com/terraform/tutorials/aws/aws-rds?utm_medium=WEB_IO&in=terraform%2Faws&utm_content=DOCS&utm_source=WEBSITE&utm_offer=ARTICLE_PAGE#review-resource-configuration
- 해당 문서를 참고하면, private-subnet을 참조하는 db_subnet_group resource를 만들어야한다는 생각이 드네
<br/>

```tf
module "vpc" {
  source = "../../"

  name = local.name
  cidr = local.vpc_cidr

  azs                 = local.azs
  private_subnets     = [for k, v in local.azs : cidrsubnet(local.vpc_cidr, 8, k)]
  public_subnets      = [for k, v in local.azs : cidrsubnet(local.vpc_cidr, 8, k + 4)]
  database_subnets    = [for k, v in local.azs : cidrsubnet(local.vpc_cidr, 8, k + 8)] # 목적에 맞는 subnet 구성
  elasticache_subnets = [for k, v in local.azs : cidrsubnet(local.vpc_cidr, 8, k + 12)]
  redshift_subnets    = [for k, v in local.azs : cidrsubnet(local.vpc_cidr, 8, k + 16)]
  intra_subnets       = [for k, v in local.azs : cidrsubnet(local.vpc_cidr, 8, k + 20)]
}
```

## 해결

```diff
rds {
+  create_db_subnet_group = true
  subnet_ids = module.vpc.private_subnets

  vpc_security_group_ids = [module.db_security_group.security_group_id]
}
```
- 해당하는 subnet 에 db_subnet_group resource를 생성하도록 변경


```shell
$ terraform plan
 # module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "ticketingdb subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "ticketingdb-"
      + subnet_ids              = [
          + "subnet-06ed8fd6845a4c1c5",
          + "subnet-07d1f532bf1940f35",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "ticketingdb"
        }
      + tags_all                = {
          + "Name" = "ticketingdb"
        }
      + vpc_id                  = (known after apply)
    }
```


![image](https://github.com/f-lab-clone/ticketing-infra/assets/41976906/f6da5c24-94bd-4337-a2c9-6409c4a07d3e)
- main-private-ap-northeast-2a | subnet-07d1f532bf1940f35
- main-private-ap-northeast-2b | subnet-06ed8fd6845a4c1c5

<br/>

(코드 리딩을 통해) 모듈 내부 동작 이해를 바탕으로 문제 해결


AWS 는 RDS 콘솔에서 생성하더라도 DB Subnet Group을 생성하고 Subnet을 지정해야 한다.
- 문제는 이에 대한 이해가 없어서, `create_db_subnet_group` 옵션이 새로운 subnet을 생성한다고 이해하고 있었다.
- 그래서 subnet_ids만 사용했다. 